#+TITLE: DM1 Week 00 Teach
#+LANGUAGE: en
#+OPTIONS: H:4 num:nil toc:nil \n:nil @:t ::t |:t ^:t *:t TeX:t LaTeX:t
#+OPTIONS: html-postamble:nil
#+STARTUP: showeverything entitiespretty
#+SETUPFILE: ../theme-bigblow.setup

[[elisp:(find-file-other-window%20"../week00/00-prepare.org")][Read Instructions]]
[[elisp:(browse-url-of-file%20(org-html-export-to-html))][Export to HTML and Browse]]
[[elisp:(org-clock-report%201)][Insert/Update Clock Summary Report]]
#+BEGIN: clocktable :scope file :maxlevel 2
#+CAPTION: Clock summary at [2018-04-27 Fri 14:31]
| Headline     |   Time |
|--------------+--------|
| *Total time* | *1:22* |
|--------------+--------|
| Play         |   1:00 |
| Report       |   0:22 |
#+END:

* DONE Play 
  CLOSED: [2018-04-27 Fri 00:05]
  :LOGBOOK:
  CLOCK: [2018-04-26 Thu 23:00]--[2018-04-26 Thu 24:00] =>  1:00
  :END:
  Find 3-5 classmates and play \ldquo{}guess my number\rdquo. This is the game where one of
  you picks a number between 1 and 100, and the others try to guess it as
  quickly as possible. The only clues that can be given by the one who chose the
  number are \ldquo{}smaller\rdquo if the guessed number is too big, or \ldquo{}bigger\rdquo if the
  guessed number is too small.

  You will be reminded how to evaluate the following elisp code blocks. Please
  do so, and play =guess-my-number= by evaluating elisp code. Then write up your
  results --- what you did, and what you learned:

#+BEGIN_SRC elisp :results silent
  (defun start ()
    (setq small 1
          big 100)
    (guess-my-number))

  (defun guess-my-number ()
     (/ (+ small big) 2))

  (defun smaller ()
    (setq big (- (guess-my-number) 1))
    (guess-my-number))

  (defun bigger ()
    (setq small (+ (guess-my-number) 1))
    (guess-my-number))
#+END_SRC

#+BEGIN_SRC elisp
  (start)
  (bigger)
  (smaller)
  (smaller)
  (bigger)
  (bigger)
  (smaller)
#+END_SRC

#+RESULTS:
: 59

* DONE Report
  CLOSED: [2018-04-27 Fri 14:30]
  :LOGBOOK:
  CLOCK: [2018-04-27 Fri 14:07]--[2018-04-27 Fri 14:29] =>  0:22
  :END:
From this activity I learned how to write in elisp a little
because I had no idea how to use this, so I looked up youtube 
videos to start figuring things out.

I still do not understand however how to reevalute a code block
without deleting the resutls first. I had to delete the results
each time that I wanted to run the script again to see if it would 
guess my number correctly.

elisp is deffinately going to be a learning curve for me. There 
are many differences in function names and actions. But I hope I
will have fun and get through it anyway. It is a great oportunity 
to grow my knowledge and abilities.

This game is cool be cause it is using logic to guess your number.
first it tries 50, then with the next quess it rules out half of 
the numbers, each time you make it guess again it gits rid of half
of the choices again. 

So, with 100 numbers it should not take more than 6 or 7 tries to 
guess the correct number. 
(2^7 = 128) my chance of getting it right is 1/(2^n) where n is the
number of guesses I make if I use this method.
(since each guess cuts the number of quesses left in half, with the
6th guess i have a 1/64 chance of gueesing it, but with the 7th I
have a 1/128 chance)
